#include "Geometory.h"

void Geometory::MakeBox()
{
	//--- 頂点の作成
	Vertex vtx[] = {
		//-z面
	{{-0.5f, 0.5f,-0.5f},{0.0f,0.0f}},
	{{ 0.5f, 0.5f,-0.5f},{1.0f,0.0f}},
	{{-0.5f,-0.5f,-0.5f},{0.0f,1.0f}},
	{{ 0.5f,-0.5f,-0.5f},{1.0f,1.0f}},
	//+Z
	{{ 0.5f, 0.5f, 0.5f},{0.0f,0.0f}},
	{{-0.5f, 0.5f, 0.5f},{1.0f,0.0f}},
	{{ 0.5f,-0.5f, 0.5f},{0.0f,1.0f}},
	{{-0.5f,-0.5f, 0.5f},{1.0f,1.0f}},
	////////////////////////////////////
	//-x
	{{-0.5f, 0.5f, 0.5f},{0.0f,0.0f}},
	{{-0.5f, 0.5f,-0.5f},{1.0f,0.0f}},
	{{-0.5f,-0.5f, 0.5f},{0.0f,1.0f}},
	{{-0.5f,-0.5f,-0.5f},{1.0f,1.0f}},
	//+x
	{{ 0.5f, 0.5f, -0.5f},{0.0f,0.0f}},//1   2  
	{{ 0.5f, 0.5f, 0.5f},{1.0f,0.0f}}, //3   4
	{{ 0.5f,-0.5f, -0.5f},{0.0f,1.0f}},
	{{ 0.5f,-0.5f, 0.5f},{1.0f,1.0f}},
	////-y
	{{-0.5f, 0.5f, 0.5f},{0.0f,0.0f}},    //1 z 2 
	{{ 0.5f, 0.5f, 0.5f},{1.0f,0.0f}},    //    x
	{{-0.5f, 0.5f,-0.5f},{0.0f,1.0f}},	 //3   4
	{{ 0.5f, 0.5f,-0.5f},{1.0f,1.0f}},
	////+y
	{{0.5f, -0.5f, 0.5f},{0.0f,0.0f}},  //1 x 2
	{{-0.5f, -0.5f, 0.5f},{1.0f,0.0f}},  //    z
	{{0.5f, -0.5f,-0.5f},{0.0f,1.0f}},  //3   4
	{{-0.5f, -0.5f,-0.5f},{1.0f,1.0f}},
	};

	//--- インデックスの作成
	int idx[] = {
		0,1,2,1,3,2,

		4,5,6,5,7,6,

		8,9,10,9,11,10,

		12,13,14,13,15,14,

		16,17,18,17,19,18,

		20,21,22,21,23,22

	};
	// バッファの作成
	MeshBuffer::Description desc = {};
	desc.pVtx = vtx;
	desc.vtxCount = _countof(vtx);
	desc.vtxSize = sizeof(Vertex);
	desc.pIdx = idx;
	desc.idxCount = _countof(idx);
	desc.idxSize = sizeof(int);
	desc.topology = D3D11_PRIMITIVE_TOPOLOGY_TRIANGLELIST;

	m_pBox = new MeshBuffer();
	m_pBox->Create(desc);
}
void Geometory::MakeCylinder()
{
	//--- 頂点の作成
		// 天面、底面

		// 側面

		//--- インデックスの作成
		// 天面、底面

		// 側面


		//--- バッファの作成
}

void Geometory::MakeSphere()
{
	//--- 頂点の作成

	//--- インデックスの作成

	// バッファの作成
}